In [118]:
x=3 
y=9.9

In [119]:
print x,y

3 9.9

In [120]:
x = 10/2
print x

5

In [121]:
2**4

16

In [122]:
x=100
x<=100

True

what is mod - check this

In [123]:
x=20%10
print x

0

*****************R A N G E *******************************

In [124]:
print range(5)
print range(5,100,10)

[0, 1, 2, 3, 4]
[5, 15, 25, 35, 45, 55, 65, 75, 85, 95]

In [125]:
a=1
b=1
if a & b:
 print "yes"

yes

In [126]:
print int('010',3)
print int('010',8)

3
8

In [127]:
string1 = 'Ritu'
print "Hello", string1

Hello Ritu

In [128]:
a = []
print type(a)

<type 'list'>

In [129]:
z=[['apple', 'orange'], ['carrot', 'potato']]
print z[0]
print z[0][0]

['apple', 'orange']
apple

In [130]:
num = [0,1,2,3,4,5,6,7,8,9]
print num[:9 :3]
print type(num)

[0, 3, 6]
<type 'list'>

In [131]:
i = 2
while i < 3:
    print(i ** 2)
    i = i+1
print('Bye')

4
Bye

In [132]:
import pandas as pd
import datetime

In [133]:
dt = datetime.datetime(2017,1,1)
end = datetime.datetime(2017,12,1)
step = datetime.timedelta(days=1)
dates = []

In [134]:
# unable to do this, want time period as 01-1, 02-1,03-1
while dt < end:
    dates.append(dt.strftime('2017-%m-%d'))
    dt += step

**************** DATA FRAME*******************************

In [135]:
data = {'MONTH': ['JANUARY', 'FEBRUARY', 'MARCH', 'APRIL', 'MAY'], 'TALL PINES': [18, 20, 13, 18, 19],
        'CHINGACOUSY': [15, 21, 11, 16, 16],
        'HEWSON': [16, 19, 15, 15, 14] ,
        'LOUISE HARBOUR': [17, 20, 12, 11, 15] }
frame = pd.DataFrame(data)

In [136]:
frame

   CHINGACOUSY  HEWSON  LOUISE HARBOUR     MONTH  TALL PINES
0           15      16              17   JANUARY          18
1           21      19              20  FEBRUARY          20
2           11      15              12     MARCH          13
3           16      15              11     APRIL          18
4           16      14              15       MAY          19

In [137]:
pd.DataFrame(data, columns=['MONTH', 'CHINGACOUSY', 'HEWSON', 'TALL PINES', 'LOUISE HARBOUR'])

      MONTH  CHINGACOUSY  HEWSON  TALL PINES  LOUISE HARBOUR
0   JANUARY           15      16          18              17
1  FEBRUARY           21      19          20              20
2     MARCH           11      15          13              12
3     APRIL           16      15          18              11
4       MAY           16      14          19              15

In [138]:
frame2 = pd.DataFrame(data,columns=['MONTH', 'CHINGACOUSY', 'HEWSON', 'TALL PINES', 'LOUISE HARBOUR'], index=['a', 'b', 'c', 'd', 'e'])

In [139]:
frame2.columns

Index([u'MONTH', u'CHINGACOUSY', u'HEWSON', u'TALL PINES', u'LOUISE HARBOUR'], dtype='object')

In [140]:
frame2.MONTH

a     JANUARY
b    FEBRUARY
c       MARCH
d       APRIL
e         MAY
Name: MONTH, dtype: object

In [141]:
frame2.HEWSON

a    16
b    19
c    15
d    15
e    14
Name: HEWSON, dtype: int64

In [142]:
frame2.loc['e']

MONTH             MAY
CHINGACOUSY        16
HEWSON             14
TALL PINES         19
LOUISE HARBOUR     15
Name: e, dtype: object

In [143]:
frame2['TALL PINES']

a    18
b    20
c    13
d    18
e    19
Name: TALL PINES, dtype: int64